//app.js
App({
  onLaunch: function () {
    // 展示本地存储能力
    var logs = wx.getStorageSync('logs') || []
    logs.unshift(Date.now())
    wx.setStorageSync('logs', logs)

    // 登录
    wx.login({
      success: res => {
        // 发送 res.code 到后台换取 openId, sessionKey, unionId
      }
    })
    // 获取用户信息
    wx.getSetting({
      success: res => {
        if (res.authSetting['scope.userInfo']) {
          // 已经授权，可以直接调用 getUserInfo 获取头像昵称，不会弹框
          wx.getUserInfo({
            success: res => {
              // 可以将 res 发送给后台解码出 unionId
              this.globalData.userInfo = res.userInfo

              // 由于 getUserInfo 是网络请求，可能会在 Page.onLoad 之后才返回
              // 所以此处加入 callback 以防止这种情况
              if (this.userInfoReadyCallback) {
                this.userInfoReadyCallback(res)
              }
            }
          })
        }
      }
    })
  },
  globalData: {
    userInfo: null,
    level:null,
    date:null,
    markRule:[
          [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
          [2,2,2,2,2,2,2,3,2,2,3,2,2,3,3,3,4,4,4,3,3],
          [2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,1,1,3,3,3,3]
    ],
    rightAnswer:{
      "N2":{
        "2010_7": [
          [3,1,2,4,2,4,2,3,1,3,1,3,4,2,4,2,4,1,3,1,3,4,3,1,2,1,4,4,2,3,2,1,3,1,3,3,4,2,2,4,2,3,1,4,4,2,1,3,4,2,2,3,1,4], 
          [2,3,4,2,1,3,3,1,2,3,4,1,3,3,1,1,3,2,4,2,4], 
          [4,3,2,3,3,3,2,2,2,2,4,1,1,3,2,2,2,1,3,3,1,1,3,2,2,3,1,3,2,3,2,3]
        ],
        "2011_7": [[], [], []],
        "2012_7": [[], [], []],
        "2013_7": [[], [], []],
        "2014_7": [[], [], []],
        "2015_7": [[], [], []],
        "2016_7": [[], [], []],
        "2017_7": [[], [], []],
        "2018_7": [[], [], []],
        "2019_7": [[], [], []],
        "2010_12": [[], [], []],
        "2011_12": [[], [], []],
        "2012_12": [[], [], []],
        "2013_12": [[], [], []],
        "2014_12": [
          [], 
          [], 
          []
        ],
        "2015_12": [
          [], 
          [], 
          []
        ],
        "2016_12": [[], [], []],
        "2017_12": [[], [], []],
        "2018_12": [[], [], []],
      },
    }
  }
})